Terraform will perform the following actions:
  # module.homefs.google_filestore_instance.filestore_instance will be updated in-place
  ~ resource "google_filestore_instance" "filestore_instance" {
        id          = "projects/prj-n-005-cloudops-618d/locations/northamerica-northeast1-c/instances/hpc-small-f17a00ba"
      ~ labels      = {
          ~ "ghpc_blueprint"  = "hpc-cluster-small" -> "hpc-slurm"
          + "ghpc_module"     = "filestore"
            # (2 unchanged elements hidden)
        }
        name        = "hpc-small-f17a00ba"
        # (4 unchanged attributes hidden)
        # (2 unchanged blocks hidden)
    }
  # module.compute_partition.module.slurm_partition.data.google_compute_instance_template.group_template["ghpc"] will be read during apply
  # (config refers to values not yet known)
 <= data "google_compute_instance_template" "group_template" {
      + advanced_machine_features    = (known after apply)
      + can_ip_forward               = (known after apply)
      + confidential_instance_config = (known after apply)
      + description                  = (known after apply)
      + disk                         = (known after apply)
      + guest_accelerator            = (known after apply)
      + id                           = (known after apply)
      + instance_description         = (known after apply)
      + labels                       = (known after apply)
      + machine_type                 = (known after apply)
      + metadata                     = (known after apply)
      + metadata_fingerprint         = (known after apply)
      + metadata_startup_script      = (known after apply)
      + min_cpu_platform             = (known after apply)
      + name                         = (known after apply)
      + name_prefix                  = (known after apply)
      + network_interface            = (known after apply)
      + network_performance_config   = (known after apply)
      + project                      = "prj-n-005-cloudops-618d"
      + region                       = (known after apply)
      + reservation_affinity         = (known after apply)
      + resource_policies            = (known after apply)
      + scheduling                   = (known after apply)
      + self_link                    = (known after apply)
      + service_account              = (known after apply)
      + shielded_instance_config     = (known after apply)
      + tags                         = (known after apply)
      + tags_fingerprint             = (known after apply)
    }
  # module.compute_partition.module.slurm_partition.google_compute_project_metadata_item.partition_startup_scripts["ghpc_startup_sh"] will be created
  + resource "google_compute_project_metadata_item" "partition_startup_scripts" {
      + id      = (known after apply)
      + key     = "hpcsmall-slurm-partition-compute-script-ghpc_startup_sh"
      + project = "prj-n-005-cloudops-618d"
      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }
  # module.compute_partition.module.slurm_partition.null_resource.partition will be created
  + resource "null_resource" "partition" {
      + id       = (known after apply)
      + triggers = {
          + "partition" = (known after apply)
        }
    }
  # module.debug_partition.module.slurm_partition.data.google_compute_instance_template.group_template["ghpc"] will be read during apply
  # (config refers to values not yet known)
 <= data "google_compute_instance_template" "group_template" {
      + advanced_machine_features    = (known after apply)
      + can_ip_forward               = (known after apply)
      + confidential_instance_config = (known after apply)
      + description                  = (known after apply)
      + disk                         = (known after apply)
      + guest_accelerator            = (known after apply)
      + id                           = (known after apply)
      + instance_description         = (known after apply)
      + labels                       = (known after apply)
      + machine_type                 = (known after apply)
      + metadata                     = (known after apply)
      + metadata_fingerprint         = (known after apply)
      + metadata_startup_script      = (known after apply)
      + min_cpu_platform             = (known after apply)
      + name                         = (known after apply)
      + name_prefix                  = (known after apply)
      + network_interface            = (known after apply)
      + network_performance_config   = (known after apply)
      + project                      = "prj-n-005-cloudops-618d"
      + region                       = (known after apply)
      + reservation_affinity         = (known after apply)
      + resource_policies            = (known after apply)
      + scheduling                   = (known after apply)
      + self_link                    = (known after apply)
      + service_account              = (known after apply)
      + shielded_instance_config     = (known after apply)
      + tags                         = (known after apply)
      + tags_fingerprint             = (known after apply)
    }
  # module.debug_partition.module.slurm_partition.google_compute_project_metadata_item.partition_startup_scripts["ghpc_startup_sh"] will be created
  + resource "google_compute_project_metadata_item" "partition_startup_scripts" {
      + id      = (known after apply)
      + key     = "hpcsmall-slurm-partition-debug-script-ghpc_startup_sh"
      + project = "prj-n-005-cloudops-618d"
      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }
  # module.debug_partition.module.slurm_partition.null_resource.partition will be created
  + resource "null_resource" "partition" {
      + id       = (known after apply)
      + triggers = {
          + "partition" = (known after apply)
        }
    }
  # module.slurm_controller.module.slurm_controller_instance.google_compute_project_metadata_item.compute_startup_scripts["ghpc_startup_sh"] will be created
  + resource "google_compute_project_metadata_item" "compute_startup_scripts" {
      + id      = (known after apply)
      + key     = "hpcsmall-slurm-compute-script-ghpc_startup_sh"
      + project = "prj-n-005-cloudops-618d"
      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }
  # module.slurm_controller.module.slurm_controller_instance.google_compute_project_metadata_item.config will be updated in-place
  ~ resource "google_compute_project_metadata_item" "config" {
        id      = "hpcsmall-slurm-config"
      ~ value   = jsonencode(
            {
              - cloud_parameters                   = {
                  - resume_rate     = 0
                  - resume_timeout  = 300
                  - suspend_rate    = 0
                  - suspend_timeout = 300
                }
              - cloudsql                           = false
              - cluster_id                         = "4cedd5f1-5ef7-a26d-470c-e5e22128e20a"
              - compute_startup_scripts_timeout    = 300
              - controller_startup_scripts_timeout = 300
              - disable_default_mounts             = false
              - enable_bigquery_load               = false
              - enable_reconfigure                 = false
              - epilog_scripts                     = []
              - login_network_storage              = [
                  - {
                      - fs_type       = "nfs"
                      - local_mount   = "/home"
                      - mount_options = "defaults,_netdev"
                      - remote_mount  = "/nfsshare"
                      - server_ip     = "10.165.1.2"
                    },
                ]
              - login_startup_scripts_timeout      = 300
              - network_storage                    = [
                  - {
                      - fs_type       = "nfs"
                      - local_mount   = "/home"
                      - mount_options = "defaults,_netdev"
                      - remote_mount  = "/nfsshare"
                      - server_ip     = "10.165.1.2"
                    },
                ]
              - partitions                         = {
                  - compute = {
                      - enable_job_exclusive              = true
                      - enable_placement_groups           = true
                      - network_storage                   = [
                          - {
                              - fs_type       = "nfs"
                              - local_mount   = "/home"
                              - mount_options = "defaults,_netdev"
                              - remote_mount  = "/nfsshare"
                              - server_ip     = "10.165.1.2"
                            },
                        ]
                      - partition_conf                    = {}
                      - partition_name                    = "compute"
                      - partition_nodes                   = {
                          - ghpc = {
                              - access_config          = []
                              - bandwidth_tier         = "platform_default"
                              - enable_spot_vm         = false
                              - group_name             = "ghpc"
                              - instance_template      = "https://www.googleapis.com/compute/v1/projects/prj-n-005-cloudops-618d/global/instanceTemplates/hpcsmall-compute-compute-ghpc-20[230](https://gitlab.com/CamecoCorporation/cloud-operations/terraform-services/terraform-gcp-005-cloudops/-/jobs/4681405461#L230)203212654007000000003"
                              - node_conf              = {}
                              - node_count_dynamic_max = 20
                              - node_count_static      = 0
                              - spot_instance_config   = {
                                  - termination_action = "STOP"
                                }
                            }
                        }
                      - partition_startup_scripts_timeout = 300
                      - subnetwork                        = "https://www.googleapis.com/compute/v1/projects/prj-n-shared-restricted-8521/regions/northamerica-northeast1/subnetworks/sb-n-shared-restricted-northamerica-northeast1"
                      - zone_policy_allow                 = [
                          - "northamerica-northeast1-c",
                        ]
                      - zone_policy_deny                  = [
                          - "northamerica-northeast1-a",
                          - "northamerica-northeast1-b",
                        ]
                    }
                  - debug   = {
                      - enable_job_exclusive              = true
                      - enable_placement_groups           = false
                      - network_storage                   = [
                          - {
                              - fs_type       = "nfs"
                              - local_mount   = "/home"
                              - mount_options = "defaults,_netdev"
                              - remote_mount  = "/nfsshare"
                              - server_ip     = "10.165.1.2"
                            },
                        ]
                      - partition_conf                    = {
                          - Default = "YES"
                        }
                      - partition_name                    = "debug"
                      - partition_nodes                   = {
                          - ghpc = {
                              - access_config          = []
                              - bandwidth_tier         = "platform_default"
                              - enable_spot_vm         = false
                              - group_name             = "ghpc"
                              - instance_template      = "https://www.googleapis.com/compute/v1/projects/prj-n-005-cloudops-618d/global/instanceTemplates/hpcsmall-compute-debug-ghpc-20230203212654016100000004"
                              - node_conf              = {}
                              - node_count_dynamic_max = 4
                              - node_count_static      = 0
                              - spot_instance_config   = {
                                  - termination_action = "STOP"
                                }
                            }
                        }
                      - partition_startup_scripts_timeout = 300
                      - subnetwork                        = "https://www.googleapis.com/compute/v1/projects/prj-n-shared-restricted-8521/regions/northamerica-northeast1/subnetworks/sb-n-shared-restricted-northamerica-northeast1"
                      - zone_policy_allow                 = [
                          - "northamerica-northeast1-c",
                        ]
                      - zone_policy_deny                  = [
                          - "northamerica-northeast1-a",
                          - "northamerica-northeast1-b",
                        ]
                    }
                }
              - project                            = "prj-n-005-cloudops-618d"
              - prolog_scripts                     = []
              - pubsub_topic_id                    = null
              - slurm_cluster_name                 = "hpcsmall"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }
  # module.slurm_controller.module.slurm_controller_instance.google_compute_project_metadata_item.controller_startup_scripts["ghpc_startup_sh"] will be created
  + resource "google_compute_project_metadata_item" "controller_startup_scripts" {
      + id      = (known after apply)
      + key     = "hpcsmall-slurm-controller-script-ghpc_startup_sh"
      + project = "prj-n-005-cloudops-618d"
      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }
  # module.slurm_controller.module.slurm_controller_instance.google_compute_project_metadata_item.slurm_conf will be updated in-place
  ~ resource "google_compute_project_metadata_item" "slurm_conf" {
        id      = "hpcsmall-slurm-tpl-slurm-conf"
      ~ value   = <<-EOT
            # slurm.conf
            # https://slurm.schedmd.com/slurm.conf.html
            # https://slurm.schedmd.com/configurator.html
            
            ProctrackType=proctrack/cgroup
            SlurmctldPidFile=/var/run/slurm/slurmctld.pid
            SlurmdPidFile=/var/run/slurm/slurmd.pid
            TaskPlugin=task/affinity,task/cgroup
          + MaxNodeCount=64000
            
            #
            #
            # SCHEDULING
            SchedulerType=sched/backfill
            SelectType=select/cons_tres
            SelectTypeParameters=CR_Core_Memory
            
            #
            #
            # LOGGING AND ACCOUNTING
          + AccountingStoreFlags=job_comment
            JobAcctGatherFrequency=30
            JobAcctGatherType=jobacct_gather/cgroup
            SlurmctldDebug=info
            SlurmdDebug=info
          + DebugFlags=Power
            
          + #
          + #
          + # TIMERS
          + MessageTimeout=60
          + 
            ################################################################################
            #              vvvvv  WARNING: DO NOT MODIFY SECTION BELOW  vvvvv              #
            ################################################################################
            
          - SlurmctldHost={control_host}
          + SlurmctldHost={control_host}({control_addr})
            
            AuthType=auth/munge
            AuthInfo=cred_expire=120
            AuthAltTypes=auth/jwt
            CredType=cred/munge
            MpiDefault={mpi_default}
            ReturnToService=2
          - SlurmctldPort=6820-6830
          + SlurmctldPort={control_host_port}
            SlurmdPort=6818
            SlurmdSpoolDir=/var/spool/slurmd
            SlurmUser=slurm
            StateSaveLocation={state_save}
            
            #
            #
          - # TIMERS
          - MessageTimeout=60
          - 
          - #
          - #
            # LOGGING AND ACCOUNTING
            AccountingStorageType=accounting_storage/slurmdbd
            AccountingStorageHost={control_host}
            ClusterName={name}
            SlurmctldLogFile={slurmlog}/slurmctld.log
            SlurmdLogFile={slurmlog}/slurmd-%n.log
            
            #
            #
            # GENERATED CLOUD CONFIGURATIONS
            include cloud.conf
            
            ################################################################################
            #              ^^^^^  WARNING: DO NOT MODIFY SECTION ABOVE  ^^^^^              #
            ################################################################################
        EOT
        # (2 unchanged attributes hidden)
      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }
  # module.slurm_login.module.slurm_login_instance.google_compute_project_metadata_item.login_startup_scripts["ghpc_startup_sh"] will be created
  + resource "google_compute_project_metadata_item" "login_startup_scripts" {
      + id      = (known after apply)
      + key     = "hpcsmall-slurm-login_vicyomx9-script-ghpc_startup_sh"
      + project = "prj-n-005-cloudops-618d"
      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }
  # module.slurm_controller.module.slurm_controller_instance.module.slurm_controller_instance.data.google_compute_instance_template.base will be read during apply
  # (config refers to values not yet known)
 <= data "google_compute_instance_template" "base" {
      + advanced_machine_features    = (known after apply)
      + can_ip_forward               = (known after apply)
      + confidential_instance_config = (known after apply)
      + description                  = (known after apply)
      + disk                         = (known after apply)
      + guest_accelerator            = (known after apply)
      + id                           = (known after apply)
      + instance_description         = (known after apply)
      + labels                       = (known after apply)
      + machine_type                 = (known after apply)
      + metadata                     = (known after apply)
      + metadata_fingerprint         = (known after apply)
      + metadata_startup_script      = (known after apply)
      + min_cpu_platform             = (known after apply)
      + name                         = (known after apply)
      + name_prefix                  = (known after apply)
      + network_interface            = (known after apply)
      + network_performance_config   = (known after apply)
      + project                      = "prj-n-005-cloudops-618d"
      + region                       = (known after apply)
      + reservation_affinity         = (known after apply)
      + resource_policies            = (known after apply)
      + scheduling                   = (known after apply)
      + self_link                    = (known after apply)
      + service_account              = (known after apply)
      + shielded_instance_config     = (known after apply)
      + tags                         = (known after apply)
      + tags_fingerprint             = (known after apply)
    }
  # module.slurm_controller.module.slurm_controller_instance.module.slurm_controller_instance.data.google_compute_zones.available will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_zones" "available" {
      + id      = (known after apply)
      + names   = (known after apply)
      + project = "prj-n-005-cloudops-618d"
      + region  = "northamerica-northeast1"
    }
  # module.slurm_controller.module.slurm_controller_instance.module.slurm_controller_instance.data.local_file.startup will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_file" "startup" {
      + content              = (known after apply)
      + content_base64       = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + filename             = "/builds/CamecoCorporation/cloud-operations/terraform-services/terraform-gcp-005-cloudops/nonproduction/.terraform/modules/slurm_controller.slurm_controller_instance/scripts/startup.sh"
      + id                   = (known after apply)
    }
  # module.slurm_controller.module.slurm_controller_instance.module.slurm_controller_instance.google_compute_instance_from_template.slurm_instance[0] must be replaced
-/+ resource "google_compute_instance_from_template" "slurm_instance" {
      ~ attached_disk             = [] -> (known after apply)
      ~ can_ip_forward            = false -> (known after apply)
      ~ cpu_platform              = "Intel Cascade Lake" -> (known after apply)
      ~ current_status            = "RUNNING" -> (known after apply)
      ~ deletion_protection       = false -> (known after apply)
      + description               = (known after apply)
      + desired_status            = (known after apply)
      ~ enable_display            = false -> (known after apply)
      ~ guest_accelerator         = [] -> (known after apply)
      + hostname                  = (known after apply)
      ~ id                        = "projects/prj-n-005-cloudops-618d/zones/northamerica-northeast1-c/instances/hpcsmall-controller" -> (known after apply)
      ~ instance_id               = "6587939781759493843" -> (known after apply)
      ~ label_fingerprint         = "mpKxhCOXOxo=" -> (known after apply)
      ~ labels                    = {
          - "ghpc_blueprint"      = "hpc-cluster-small"
          - "ghpc_deployment"     = "hpc-small"
          - "ghpc_role"           = "scheduler"
          - "slurm_cluster_name"  = "hpcsmall"
          - "slurm_instance_role" = "controller"
        } -> (known after apply)
      ~ machine_type              = "c2-standard-4" -> (known after apply)
      ~ metadata                  = {
          - "VmDnsSetting"        = "GlobalOnly"
          - "enable-oslogin"      = "TRUE"
          - "slurm_cluster_name"  = "hpcsmall"
          - "slurm_instance_role" = "controller"
          - "startup-script"      = <<-EOT
                #!/bin/bash
                # Copyright (C) SchedMD LLC.
                #
                # Licensed under the Apache License, Version 2.0 (the "License");
                # you may not use this file except in compliance with the License.
                # You may obtain a copy of the License at
                #
                #     http://www.apache.org/licenses/LICENSE-2.0
                #
                # Unless required by applicable law or agreed to in writing, software
                # distributed under the License is distributed on an "AS IS" BASIS,
                # WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
                # See the License for the specific language governing permissions and
                # limitations under the License.
                
                set -e
                
                SLURM_DIR=/slurm
                FLAGFILE=$SLURM_DIR/slurm_configured_do_not_remove
                SCRIPTS_DIR=$SLURM_DIR/scripts
                
                METADATA_SERVER="metadata.google.internal"
                URL="http://$METADATA_SERVER/computeMetadata/v1"
                HEADER="Metadata-Flavor:Google"
                CURL="curl -sS --fail --header $HEADER"
                
                function fetch_scripts {
                	# fetch project metadata
                	if ! CLUSTER=$($CURL $URL/instance/attributes/slurm_cluster_name); then
                		echo cluster name not found in instance metadata, quitting
                		return 1
                	fi
                	if ! META_DEVEL=$($CURL $URL/project/attributes/$CLUSTER-slurm-devel); then
                        echo $CLUSTER-slurm-devel not found in project metadata, skipping script update
                		return
                	fi
                	echo devel data found in project metadata, looking to update scripts
                	if STARTUP_SCRIPT=$(jq -re '."startup-script"' <<< "$META_DEVEL"); then
                		echo updating startup.sh from project metadata
                		printf '%s' "$STARTUP_SCRIPT" > $STARTUP_SCRIPT_FILE
                	else
                		echo startup-script not found in project metadata, skipping update
                	fi
                	if SETUP_SCRIPT=$(jq -re '."setup-script"' <<< "$META_DEVEL"); then
                		echo updating setup.py from project metadata
                		printf '%s' "$SETUP_SCRIPT" > $SETUP_SCRIPT_FILE
                	else
                		echo setup-script not found in project metadata, skipping update
                	fi
                	if UTIL_SCRIPT=$(jq -re '."util-script"' <<< "$META_DEVEL"); then
                		echo updating util.py from project metadata
                		printf '%s' "$UTIL_SCRIPT" > $UTIL_SCRIPT_FILE
                	else
                		echo util-script not found in project metadata, skipping update
                	fi
                	if RESUME_SCRIPT=$(jq -re '."slurm-resume"' <<< "$META_DEVEL"); then
                		echo updating resume.py from project metadata
                		printf '%s' "$RESUME_SCRIPT" > $RESUME_SCRIPT_FILE
                	else
                		echo slurm-resume not found in project metadata, skipping update
                	fi
                	if SUSPEND_SCRIPT=$(jq -re '."slurm-suspend"' <<< "$META_DEVEL"); then
                		echo updating suspend.py from project metadata
                		printf '%s' "$SUSPEND_SCRIPT" > $SUSPEND_SCRIPT_FILE
                	else
                		echo slurm-suspend not found in project metadata, skipping update
                	fi
                	if SLURMSYNC_SCRIPT=$(jq -re '."slurmsync"' <<< "$META_DEVEL"); then
                		echo updating slurmsync.py from project metadata
                		printf '%s' "$SLURMSYNC_SCRIPT" > $SLURMSYNC_SCRIPT_FILE
                	else
                		echo slurmsync not found in project metadata, skipping update
                	fi
                	if SLURMEVENTD_SCRIPT=$(jq -re '."slurmeventd"' <<< "$META_DEVEL"); then
                		echo "updating slurmeventd.py from project metadata"
                		printf '%s' "$SLURMEVENTD_SCRIPT" > $SLURMEVENTD_SCRIPT_FILE
                	else
                		echo "slurmeventd not found in project metadata, skipping update"
                	fi
                }
                
                PING_METADATA="ping -q -w1 -c1 $METADATA_SERVER"
                echo $PING_METADATA
                for i in $(seq 10); do
                    [ $i -gt 1 ] && sleep 5;
                    $PING_METADATA > /dev/null && s=0 && break || s=$?;
                    echo failed to contact metadata server, will retry
                done
                if [ $s -ne 0 ]; then
                    echo Unable to contact metadata server, aborting
                    wall -n '*** Slurm setup failed in the startup script! see `journalctl -u google-startup-scripts` ***'
                    exit 1
                else
                    echo Successfully contacted metadata server
                fi
                
                GOOGLE_DNS=8.8.8.8
                PING_GOOGLE="ping -q -w1 -c1 $GOOGLE_DNS"
                echo $PING_GOOGLE
                for i in $(seq 5); do
                    [ $i -gt 1 ] && sleep 2;
                    $PING_GOOGLE > /dev/null && s=0 && break || s=$?;
                    echo failed to ping Google DNS, will retry
                done
                if [ $s -ne 0 ]; then
                    echo No internet access detected
                else
                    echo Internet access detected
                fi
                
                mkdir -p $SCRIPTS_DIR
                
                STARTUP_SCRIPT_FILE=$SCRIPTS_DIR/startup.sh
                SETUP_SCRIPT_FILE=$SCRIPTS_DIR/setup.py
                UTIL_SCRIPT_FILE=$SCRIPTS_DIR/util.py
                RESUME_SCRIPT_FILE=$SCRIPTS_DIR/resume.py
                SUSPEND_SCRIPT_FILE=$SCRIPTS_DIR/suspend.py
                SLURMSYNC_SCRIPT_FILE=$SCRIPTS_DIR/slurmsync.py
                SLURMEVENTD_SCRIPT_FILE=$SCRIPTS_DIR/slurmeventd.py
                fetch_scripts
                
                if [ -f $FLAGFILE ]; then
                	echo "Slurm was previously configured, quitting"
                	exit 0
                fi
                touch $FLAGFILE
                
                echo "running python cluster setup script"
                chmod +x $SETUP_SCRIPT_FILE
                python3 $SCRIPTS_DIR/util.py
                exec $SETUP_SCRIPT_FILE
            EOT
        } -> (known after apply)
      ~ metadata_fingerprint      = "KzqAjKQhEsQ=" -> (known after apply)
      + metadata_startup_script   = (known after apply)
      + min_cpu_platform          = (known after apply)
        name                      = "hpcsmall-controller"
      ~ resource_policies         = [] -> (known after apply)
      ~ scratch_disk              = [] -> (known after apply)
      ~ self_link                 = "https://www.googleapis.com/compute/v1/projects/prj-n-005-cloudops-618d/zones/northamerica-northeast1-c/instances/hpcsmall-controller" -> (known after apply)
      ~ service_account           = [
          - {
              - email  = "1093909091653-compute@developer.gserviceaccount.com"
              - scopes = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ]
            },
        ] -> (known after apply)
      ~ source_instance_template  = "https://www.googleapis.com/compute/v1/projects/prj-n-005-cloudops-618d/global/instanceTemplates/hpcsmall-controller-default-20230203212653990000000001" -> (known after apply) # forces replacement
      ~ tags                      = [
          - "hpcsmall",
        ] -> (known after apply)
      ~ tags_fingerprint          = "dxlKa7m5L5g=" -> (known after apply)
        # (3 unchanged attributes hidden)
      ~ advanced_machine_features {
          ~ enable_nested_virtualization = false -> (known after apply)
          ~ threads_per_core             = 1 -> (known after apply)
          ~ visible_core_count           = 0 -> (known after apply)
        }
      ~ boot_disk {
          ~ auto_delete                = true -> (known after apply)
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_raw    = (sensitive value)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ mode                       = "READ_WRITE" -> (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/prj-n-005-cloudops-618d/zones/northamerica-northeast1-c/disks/hpcsmall-controller" -> (known after apply)
          ~ initialize_params {
              ~ image                 = "https://www.googleapis.com/compute/v1/projects/schedmd-slurm-public/global/images/schedmd-v5-slurm-22-05-4-hpc-centos-7-1665675565" -> (known after apply)
              ~ labels                = {
                  - "ghpc_blueprint"      = "hpc-cluster-small"
                  - "ghpc_deployment"     = "hpc-small"
                  - "ghpc_role"           = "scheduler"
                  - "slurm_cluster_name"  = "hpcsmall"
                  - "slurm_instance_role" = "controller"
                } -> (known after apply)
              ~ resource_manager_tags = {} -> (known after apply)
              ~ size                  = 50 -> (known after apply)
              ~ type                  = "pd-ssd" -> (known after apply)
            }
        }
      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }
      ~ network_interface {
          ~ access_config      = [
              + {
                  + nat_ip                 = (known after apply)
                  + network_tier           = (known after apply)
                  + public_ptr_domain_name = (known after apply)
                },
            ]
          ~ alias_ip_range     = [] -> (known after apply)
          + ipv6_access_type   = (known after apply)
          ~ name               = "nic0" -> (known after apply)
          ~ network_ip         = "10.161.0.59" -> (known after apply)
          + nic_type           = (known after apply)
          ~ queue_count        = 0 -> (known after apply)
          ~ stack_type         = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork_project = "prj-n-shared-restricted-8521" -> (known after apply)
            # (2 unchanged attributes hidden)
          + ipv6_access_config {
              + external_ipv6               = (known after apply)
              + external_ipv6_prefix_length = (known after apply)
              + network_tier                = (known after apply)
              + public_ptr_domain_name      = (known after apply)
            }
        }
      + network_performance_config {
          + total_egress_bandwidth_tier = (known after apply)
        }
      + params {
          + resource_manager_tags = (known after apply)
        }
      + reservation_affinity {
          + type = (known after apply)
          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }
      ~ scheduling {
          ~ automatic_restart           = true -> (known after apply)
          + instance_termination_action = (known after apply)
          ~ min_node_cpus               = 0 -> (known after apply)
          ~ on_host_maintenance         = "MIGRATE" -> (known after apply)
          ~ preemptible                 = false -> (known after apply)
          ~ provisioning_model          = "STANDARD" -> (known after apply)
          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }
  # module.slurm_controller.module.slurm_controller_template.module.instance_template.google_compute_instance_template.tpl must be replaced
+/- resource "google_compute_instance_template" "tpl" {
      ~ id                      = "projects/prj-n-005-cloudops-618d/global/instanceTemplates/hpcsmall-controller-default-20230203212653990000000001" -> (known after apply)
      ~ labels                  = { # forces replacement
          ~ "ghpc_blueprint"      = "hpc-cluster-small" -> "hpc-slurm"
          + "ghpc_module"         = "schedmd-slurm-gcp-v5-controller"
            # (4 unchanged elements hidden)
        }
      ~ metadata_fingerprint    = "KzqAjKQhEsQ=" -> (known after apply)
      ~ metadata_startup_script = <<-EOT # forces replacement
            #!/bin/bash
            # Copyright (C) SchedMD LLC.
            #
            # Licensed under the Apache License, Version 2.0 (the "License");
            # you may not use this file except in compliance with the License.
            # You may obtain a copy of the License at
            #
            #     http://www.apache.org/licenses/LICENSE-2.0
            #
            # Unless required by applicable law or agreed to in writing, software
            # distributed under the License is distributed on an "AS IS" BASIS,
            # WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
            # See the License for the specific language governing permissions and
            # limitations under the License.
            
            set -e
            
            SLURM_DIR=/slurm
            FLAGFILE=$SLURM_DIR/slurm_configured_do_not_remove
            SCRIPTS_DIR=$SLURM_DIR/scripts
            
            METADATA_SERVER="metadata.google.internal"
            URL="http://$METADATA_SERVER/computeMetadata/v1"
            HEADER="Metadata-Flavor:Google"
            CURL="curl -sS --fail --header $HEADER"
            
            function fetch_scripts {
            	# fetch project metadata
            	if ! CLUSTER=$($CURL $URL/instance/attributes/slurm_cluster_name); then
          - 		echo cluster name not found in instance metadata, quitting
          + 		echo "ERROR: cluster name not found in instance metadata. Quitting!"
            		return 1
            	fi
            	if ! META_DEVEL=$($CURL $URL/project/attributes/$CLUSTER-slurm-devel); then
          -         echo $CLUSTER-slurm-devel not found in project metadata, skipping script update
          + 		echo "WARNING: $CLUSTER-slurm-devel not found in project metadata, skipping script update"
            		return
            	fi
            	echo devel data found in project metadata, looking to update scripts
            	if STARTUP_SCRIPT=$(jq -re '."startup-script"' <<< "$META_DEVEL"); then
          - 		echo updating startup.sh from project metadata
          + 		echo "INFO: updating startup.sh from project metadata"
            		printf '%s' "$STARTUP_SCRIPT" > $STARTUP_SCRIPT_FILE
            	else
          - 		echo startup-script not found in project metadata, skipping update
          + 		echo "WARNING: startup-script not found in project metadata, skipping update"
            	fi
            	if SETUP_SCRIPT=$(jq -re '."setup-script"' <<< "$META_DEVEL"); then
          - 		echo updating setup.py from project metadata
          + 		echo "INFO: updating setup.py from project metadata"
            		printf '%s' "$SETUP_SCRIPT" > $SETUP_SCRIPT_FILE
            	else
          - 		echo setup-script not found in project metadata, skipping update
          + 		echo "WARNING: setup-script not found in project metadata, skipping update"
            	fi
            	if UTIL_SCRIPT=$(jq -re '."util-script"' <<< "$META_DEVEL"); then
          - 		echo updating util.py from project metadata
          + 		echo "INFO: updating util.py from project metadata"
            		printf '%s' "$UTIL_SCRIPT" > $UTIL_SCRIPT_FILE
            	else
          - 		echo util-script not found in project metadata, skipping update
          + 		echo "WARNING: util-script not found in project metadata, skipping update"
            	fi
            	if RESUME_SCRIPT=$(jq -re '."slurm-resume"' <<< "$META_DEVEL"); then
          - 		echo updating resume.py from project metadata
          + 		echo "INFO: updating resume.py from project metadata"
            		printf '%s' "$RESUME_SCRIPT" > $RESUME_SCRIPT_FILE
            	else
          - 		echo slurm-resume not found in project metadata, skipping update
          + 		echo "WARNING: slurm-resume not found in project metadata, skipping update"
            	fi
            	if SUSPEND_SCRIPT=$(jq -re '."slurm-suspend"' <<< "$META_DEVEL"); then
          - 		echo updating suspend.py from project metadata
          + 		echo "INFO: updating suspend.py from project metadata"
            		printf '%s' "$SUSPEND_SCRIPT" > $SUSPEND_SCRIPT_FILE
            	else
          - 		echo slurm-suspend not found in project metadata, skipping update
          + 		echo "WARNING: slurm-suspend not found in project metadata, skipping update"
            	fi
            	if SLURMSYNC_SCRIPT=$(jq -re '."slurmsync"' <<< "$META_DEVEL"); then
          - 		echo updating slurmsync.py from project metadata
          + 		echo "INFO: updating slurmsync.py from project metadata"
            		printf '%s' "$SLURMSYNC_SCRIPT" > $SLURMSYNC_SCRIPT_FILE
            	else
          - 		echo slurmsync not found in project metadata, skipping update
          + 		echo "WARNING: slurmsync not found in project metadata, skipping update"
            	fi
            	if SLURMEVENTD_SCRIPT=$(jq -re '."slurmeventd"' <<< "$META_DEVEL"); then
          - 		echo "updating slurmeventd.py from project metadata"
          + 		echo "INFO: updating slurmeventd.py from project metadata"
            		printf '%s' "$SLURMEVENTD_SCRIPT" > $SLURMEVENTD_SCRIPT_FILE
            	else
          - 		echo "slurmeventd not found in project metadata, skipping update"
          + 		echo "WARNING: slurmeventd not found in project metadata, skipping update"
            	fi
            }
            
            PING_METADATA="ping -q -w1 -c1 $METADATA_SERVER"
          - echo $PING_METADATA
          + echo "INFO: $PING_METADATA"
            for i in $(seq 10); do
                [ $i -gt 1 ] && sleep 5;
                $PING_METADATA > /dev/null && s=0 && break || s=$?;
          -     echo failed to contact metadata server, will retry
          +     echo "ERROR: Failed to contact metadata server, will retry"
            done
            if [ $s -ne 0 ]; then
          -     echo Unable to contact metadata server, aborting
          +     echo "ERROR: Unable to contact metadata server, aborting"
                wall -n '*** Slurm setup failed in the startup script! see `journalctl -u google-startup-scripts` ***'
                exit 1
            else
          -     echo Successfully contacted metadata server
          +     echo "INFO: Successfully contacted metadata server"
            fi
            
            GOOGLE_DNS=8.8.8.8
            PING_GOOGLE="ping -q -w1 -c1 $GOOGLE_DNS"
          - echo $PING_GOOGLE
          + echo "INFO: $PING_GOOGLE"
            for i in $(seq 5); do
                [ $i -gt 1 ] && sleep 2;
                $PING_GOOGLE > /dev/null && s=0 && break || s=$?;
          -     echo failed to ping Google DNS, will retry
          + 	echo "failed to ping Google DNS, will retry"
            done
            if [ $s -ne 0 ]; then
          -     echo No internet access detected
          +     echo "WARNING: No internet access detected"
            else
          -     echo Internet access detected
          +     echo "INFO: Internet access detected"
            fi
            
            mkdir -p $SCRIPTS_DIR
            
            STARTUP_SCRIPT_FILE=$SCRIPTS_DIR/startup.sh
            SETUP_SCRIPT_FILE=$SCRIPTS_DIR/setup.py
            UTIL_SCRIPT_FILE=$SCRIPTS_DIR/util.py
            RESUME_SCRIPT_FILE=$SCRIPTS_DIR/resume.py
            SUSPEND_SCRIPT_FILE=$SCRIPTS_DIR/suspend.py
            SLURMSYNC_SCRIPT_FILE=$SCRIPTS_DIR/slurmsync.py
            SLURMEVENTD_SCRIPT_FILE=$SCRIPTS_DIR/slurmeventd.py
            fetch_scripts
            
            if [ -f $FLAGFILE ]; then
          - 	echo "Slurm was previously configured, quitting"
          + 	echo "WARNING: Slurm was previously configured, quitting"
            	exit 0
            fi
            touch $FLAGFILE
            
          - echo "running python cluster setup script"
          + function fetch_feature {
          + 	if slurmd_feature="$($CURL $URL/instance/attributes/slurmd_feature)"; then
          + 		echo "$slurmd_feature"
          + 	else
          + 		echo ""
          + 	fi
          + }
          + SLURMD_FEATURE="$(fetch_feature)"
          + 
          + echo "INFO: Running python cluster setup script"
            chmod +x $SETUP_SCRIPT_FILE
            python3 $SCRIPTS_DIR/util.py
          - exec $SETUP_SCRIPT_FILE
          + if [[ -n "$SLURMD_FEATURE" ]]; then
          + 	echo "INFO: Running dynamic node setup."
          + 	exec $SETUP_SCRIPT_FILE --slurmd-feature="$SLURMD_FEATURE"
          + else
          + 	exec $SETUP_SCRIPT_FILE
          + fi
        EOT
      ~ name                    = "hpcsmall-controller-default-20230203212653990000000001" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/prj-n-005-cloudops-618d/global/instanceTemplates/hpcsmall-controller-default-20230203212653990000000001" -> (known after apply)
      ~ self_link_unique        = "https://www.googleapis.com/compute/v1/projects/prj-n-005-cloudops-618d/global/instanceTemplates/hpcsmall-controller-default-20230203212653990000000001?uniqueId=2904627351137600207" -> (known after apply)
        tags                    = [
            "hpcsmall",
        ]
      + tags_fingerprint        = (known after apply)
        # (6 unchanged attributes hidden)
      ~ advanced_machine_features {
          - visible_core_count           = 0 -> null
            # (2 unchanged attributes hidden)
        }
      ~ disk {
          ~ device_name       = "persistent-disk-0" -> (known after apply)
          ~ interface         = "SCSI" -> (known after apply)
          ~ labels            = { # forces replacement
              ~ "ghpc_blueprint"      = "hpc-cluster-small" -> "hpc-slurm"
              + "ghpc_module"         = "schedmd-slurm-gcp-v5-controller"
                # (4 unchanged elements hidden)
            }
          ~ mode              = "READ_WRITE" -> (known after apply)
          - resource_policies = [] -> null
          ~ source_image      = "projects/schedmd-slurm-public/global/images/family/schedmd-v5-slurm-22-05-4-hpc-centos-7" -> "projects/schedmd-slurm-public/global/images/family/slurm-gcp-5-7-hpc-centos-7" # forces replacement
            # (5 unchanged attributes hidden)
        }
      ~ network_interface {
          + ipv6_access_type   = (known after apply)
          ~ name               = "nic0" -> (known after apply)
          - queue_count        = 0 -> null
          + stack_type         = (known after apply)
          ~ subnetwork_project = "prj-n-shared-restricted-8521" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ scheduling {
          - min_node_cpus       = 0 -> null
          ~ provisioning_model  = "STANDARD" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }
  # module.slurm_login.module.slurm_login_instance.module.slurm_login_instance.data.google_compute_instance_template.base will be read during apply
  # (config refers to values not yet known)
 <= data "google_compute_instance_template" "base" {
      + advanced_machine_features    = (known after apply)
      + can_ip_forward               = (known after apply)
      + confidential_instance_config = (known after apply)
      + description                  = (known after apply)
      + disk                         = (known after apply)
      + guest_accelerator            = (known after apply)
      + id                           = (known after apply)
      + instance_description         = (known after apply)
      + labels                       = (known after apply)
      + machine_type                 = (known after apply)
      + metadata                     = (known after apply)
      + metadata_fingerprint         = (known after apply)
      + metadata_startup_script      = (known after apply)
      + min_cpu_platform             = (known after apply)
      + name                         = (known after apply)
      + name_prefix                  = (known after apply)
      + network_interface            = (known after apply)
      + network_performance_config   = (known after apply)
      + project                      = "prj-n-005-cloudops-618d"
      + region                       = (known after apply)
      + reservation_affinity         = (known after apply)
      + resource_policies            = (known after apply)
      + scheduling                   = (known after apply)
      + self_link                    = (known after apply)
      + service_account              = (known after apply)
      + shielded_instance_config     = (known after apply)
      + tags                         = (known after apply)
      + tags_fingerprint             = (known after apply)
    }
  # module.slurm_login.module.slurm_login_instance.module.slurm_login_instance.data.google_compute_zones.available will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_zones" "available" {
      + id      = (known after apply)
      + names   = (known after apply)
      + project = "prj-n-005-cloudops-618d"
      + region  = "northamerica-northeast1"
    }
  # module.slurm_login.module.slurm_login_instance.module.slurm_login_instance.data.local_file.startup will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_file" "startup" {
      + content              = (known after apply)
      + content_base64       = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + filename             = "/builds/CamecoCorporation/cloud-operations/terraform-services/terraform-gcp-005-cloudops/nonproduction/.terraform/modules/slurm_login.slurm_login_instance/scripts/startup.sh"
      + id                   = (known after apply)
    }
  # module.slurm_login.module.slurm_login_instance.module.slurm_login_instance.google_compute_instance_from_template.slurm_instance[0] must be replaced
-/+ resource "google_compute_instance_from_template" "slurm_instance" {
      ~ attached_disk             = [] -> (known after apply)
      ~ can_ip_forward            = false -> (known after apply)
      ~ cpu_platform              = "Intel Cascade Lake" -> (known after apply)
      ~ current_status            = "RUNNING" -> (known after apply)
      ~ deletion_protection       = false -> (known after apply)
      + description               = (known after apply)
      + desired_status            = (known after apply)
      ~ enable_display            = false -> (known after apply)
      ~ guest_accelerator         = [] -> (known after apply)
      + hostname                  = (known after apply)
      ~ id                        = "projects/prj-n-005-cloudops-618d/zones/northamerica-northeast1-c/instances/hpcsmall-login-vicyomx9-001" -> (known after apply)
      ~ instance_id               = "5[251](https://gitlab.com/CamecoCorporation/cloud-operations/terraform-services/terraform-gcp-005-cloudops/-/jobs/4681405461#L251)409271357204125" -> (known after apply)
      ~ label_fingerprint         = "GKubx-R0h6E=" -> (known after apply)
      ~ labels                    = {
          - "ghpc_blueprint"      = "hpc-cluster-small"
          - "ghpc_deployment"     = "hpc-small"
          - "ghpc_role"           = "scheduler"
          - "slurm_cluster_name"  = "hpcsmall"
          - "slurm_instance_role" = "login"
        } -> (known after apply)
      ~ machine_type              = "n2-standard-4" -> (known after apply)
      ~ metadata                  = {
          - "VmDnsSetting"                = "GlobalOnly"
          - "enable-oslogin"              = "TRUE"
          - "slurm_cluster_name"          = "hpcsmall"
          - "slurm_depends_on_controller" = "7d791f5ba51a6adec714baf634cb49ec61a57a91a7b4f088b936437f30d67221"
          - "slurm_instance_role"         = "login"
          - "slurm_login_suffix"          = "vicyomx9"
          - "startup-script"              = <<-EOT
                #!/bin/bash
                # Copyright (C) SchedMD LLC.
                #
                # Licensed under the Apache License, Version 2.0 (the "License");
                # you may not use this file except in compliance with the License.
                # You may obtain a copy of the License at
                #
                #     http://www.apache.org/licenses/LICENSE-2.0
                #
                # Unless required by applicable law or agreed to in writing, software
                # distributed under the License is distributed on an "AS IS" BASIS,
                # WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
                # See the License for the specific language governing permissions and
                # limitations under the License.
                
                set -e
                
                SLURM_DIR=/slurm
                FLAGFILE=$SLURM_DIR/slurm_configured_do_not_remove
                SCRIPTS_DIR=$SLURM_DIR/scripts
                
                METADATA_SERVER="metadata.google.internal"
                URL="http://$METADATA_SERVER/computeMetadata/v1"
                HEADER="Metadata-Flavor:Google"
                CURL="curl -sS --fail --header $HEADER"
                
                function fetch_scripts {
                	# fetch project metadata
                	if ! CLUSTER=$($CURL $URL/instance/attributes/slurm_cluster_name); then
                		echo cluster name not found in instance metadata, quitting
                		return 1
                	fi
                	if ! META_DEVEL=$($CURL $URL/project/attributes/$CLUSTER-slurm-devel); then
                        echo $CLUSTER-slurm-devel not found in project metadata, skipping script update
                		return
                	fi
                	echo devel data found in project metadata, looking to update scripts
                	if STARTUP_SCRIPT=$(jq -re '."startup-script"' <<< "$META_DEVEL"); then
                		echo updating startup.sh from project metadata
                		printf '%s' "$STARTUP_SCRIPT" > $STARTUP_SCRIPT_FILE
                	else
                		echo startup-script not found in project metadata, skipping update
                	fi
                	if SETUP_SCRIPT=$(jq -re '."setup-script"' <<< "$META_DEVEL"); then
                		echo updating setup.py from project metadata
                		printf '%s' "$SETUP_SCRIPT" > $SETUP_SCRIPT_FILE
                	else
                		echo setup-script not found in project metadata, skipping update
                	fi
                	if UTIL_SCRIPT=$(jq -re '."util-script"' <<< "$META_DEVEL"); then
                		echo updating util.py from project metadata
                		printf '%s' "$UTIL_SCRIPT" > $UTIL_SCRIPT_FILE
                	else
                		echo util-script not found in project metadata, skipping update
                	fi
                	if RESUME_SCRIPT=$(jq -re '."slurm-resume"' <<< "$META_DEVEL"); then
                		echo updating resume.py from project metadata
                		printf '%s' "$RESUME_SCRIPT" > $RESUME_SCRIPT_FILE
                	else
                		echo slurm-resume not found in project metadata, skipping update
                	fi
                	if SUSPEND_SCRIPT=$(jq -re '."slurm-suspend"' <<< "$META_DEVEL"); then
                		echo updating suspend.py from project metadata
                		printf '%s' "$SUSPEND_SCRIPT" > $SUSPEND_SCRIPT_FILE
                	else
                		echo slurm-suspend not found in project metadata, skipping update
                	fi
                	if SLURMSYNC_SCRIPT=$(jq -re '."slurmsync"' <<< "$META_DEVEL"); then
                		echo updating slurmsync.py from project metadata
                		printf '%s' "$SLURMSYNC_SCRIPT" > $SLURMSYNC_SCRIPT_FILE
                	else
                		echo slurmsync not found in project metadata, skipping update
                	fi
                	if SLURMEVENTD_SCRIPT=$(jq -re '."slurmeventd"' <<< "$META_DEVEL"); then
                		echo "updating slurmeventd.py from project metadata"
                		printf '%s' "$SLURMEVENTD_SCRIPT" > $SLURMEVENTD_SCRIPT_FILE
                	else
                		echo "slurmeventd not found in project metadata, skipping update"
                	fi
                }
                
                PING_METADATA="ping -q -w1 -c1 $METADATA_SERVER"
                echo $PING_METADATA
                for i in $(seq 10); do
                    [ $i -gt 1 ] && sleep 5;
                    $PING_METADATA > /dev/null && s=0 && break || s=$?;
                    echo failed to contact metadata server, will retry
                done
                if [ $s -ne 0 ]; then
                    echo Unable to contact metadata server, aborting
                    wall -n '*** Slurm setup failed in the startup script! see `journalctl -u google-startup-scripts` ***'
                    exit 1
                else
                    echo Successfully contacted metadata server
                fi
                
                GOOGLE_DNS=8.8.8.8
                PING_GOOGLE="ping -q -w1 -c1 $GOOGLE_DNS"
                echo $PING_GOOGLE
                for i in $(seq 5); do
                    [ $i -gt 1 ] && sleep 2;
                    $PING_GOOGLE > /dev/null && s=0 && break || s=$?;
                    echo failed to ping Google DNS, will retry
                done
                if [ $s -ne 0 ]; then
                    echo No internet access detected
                else
                    echo Internet access detected
                fi
                
                mkdir -p $SCRIPTS_DIR
                
                STARTUP_SCRIPT_FILE=$SCRIPTS_DIR/startup.sh
                SETUP_SCRIPT_FILE=$SCRIPTS_DIR/setup.py
                UTIL_SCRIPT_FILE=$SCRIPTS_DIR/util.py
                RESUME_SCRIPT_FILE=$SCRIPTS_DIR/resume.py
                SUSPEND_SCRIPT_FILE=$SCRIPTS_DIR/suspend.py
                SLURMSYNC_SCRIPT_FILE=$SCRIPTS_DIR/slurmsync.py
                SLURMEVENTD_SCRIPT_FILE=$SCRIPTS_DIR/slurmeventd.py
                fetch_scripts
                
                if [ -f $FLAGFILE ]; then
                	echo "Slurm was previously configured, quitting"
                	exit 0
                fi
                touch $FLAGFILE
                
                echo "running python cluster setup script"
                chmod +x $SETUP_SCRIPT_FILE
                python3 $SCRIPTS_DIR/util.py
                exec $SETUP_SCRIPT_FILE
            EOT
        } -> (known after apply)
      ~ metadata_fingerprint      = "pkseRDznsJc=" -> (known after apply)
      + metadata_startup_script   = (known after apply)
      + min_cpu_platform          = (known after apply)
        name                      = "hpcsmall-login-vicyomx9-001"
      ~ resource_policies         = [] -> (known after apply)
      ~ scratch_disk              = [] -> (known after apply)
      ~ self_link                 = "https://www.googleapis.com/compute/v1/projects/prj-n-005-cloudops-618d/zones/northamerica-northeast1-c/instances/hpcsmall-login-vicyomx9-001" -> (known after apply)
      ~ service_account           = [
          - {
              - email  = "1093909091653-compute@developer.gserviceaccount.com"
              - scopes = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ]
            },
        ] -> (known after apply)
      ~ source_instance_template  = "https://www.googleapis.com/compute/v1/projects/prj-n-005-cloudops-618d/global/instanceTemplates/hpcsmall-login-default-20230203212654003700000002" -> (known after apply) # forces replacement
      ~ tags                      = [
          - "hpcsmall",
        ] -> (known after apply)
      ~ tags_fingerprint          = "dxlKa7m5L5g=" -> (known after apply)
        # (3 unchanged attributes hidden)
      ~ advanced_machine_features {
          ~ enable_nested_virtualization = false -> (known after apply)
          ~ threads_per_core             = 1 -> (known after apply)
          ~ visible_core_count           = 0 -> (known after apply)
        }
      ~ boot_disk {
          ~ auto_delete                = true -> (known after apply)
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_raw    = (sensitive value)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ mode                       = "READ_WRITE" -> (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/prj-n-005-cloudops-618d/zones/northamerica-northeast1-c/disks/hpcsmall-login-vicyomx9-001" -> (known after apply)
          ~ initialize_params {
              ~ image                 = "https://www.googleapis.com/compute/v1/projects/schedmd-slurm-public/global/images/schedmd-v5-slurm-22-05-4-hpc-centos-7-1665675565" -> (known after apply)
              ~ labels                = {
                  - "ghpc_blueprint"      = "hpc-cluster-small"
                  - "ghpc_deployment"     = "hpc-small"
                  - "ghpc_role"           = "scheduler"
                  - "slurm_cluster_name"  = "hpcsmall"
                  - "slurm_instance_role" = "login"
                } -> (known after apply)
              ~ resource_manager_tags = {} -> (known after apply)
              ~ size                  = 50 -> (known after apply)
              ~ type                  = "pd-standard" -> (known after apply)
            }
        }
      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }
      ~ network_interface {
          ~ access_config      = [
              + {
                  + nat_ip                 = (known after apply)
                  + network_tier           = (known after apply)
                  + public_ptr_domain_name = (known after apply)
                },
            ]
          ~ alias_ip_range     = [] -> (known after apply)
          + ipv6_access_type   = (known after apply)
          ~ name               = "nic0" -> (known after apply)
          ~ network_ip         = "10.161.0.60" -> (known after apply)
          + nic_type           = (known after apply)
          ~ queue_count        = 0 -> (known after apply)
          ~ stack_type         = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork_project = "prj-n-shared-restricted-8521" -> (known after apply)
            # (2 unchanged attributes hidden)
          + ipv6_access_config {
              + external_ipv6               = (known after apply)
              + external_ipv6_prefix_length = (known after apply)
              + network_tier                = (known after apply)
              + public_ptr_domain_name      = (known after apply)
            }
        }
      + network_performance_config {
          + total_egress_bandwidth_tier = (known after apply)
        }
      + params {
          + resource_manager_tags = (known after apply)
        }
      + reservation_affinity {
          + type = (known after apply)
          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }
      ~ scheduling {
          ~ automatic_restart           = true -> (known after apply)
          + instance_termination_action = (known after apply)
          ~ min_node_cpus               = 0 -> (known after apply)
          ~ on_host_maintenance         = "MIGRATE" -> (known after apply)
          ~ preemptible                 = false -> (known after apply)
          ~ provisioning_model          = "STANDARD" -> (known after apply)
          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }
  # module.slurm_login.module.slurm_login_template.module.instance_template.google_compute_instance_template.tpl must be replaced
+/- resource "google_compute_instance_template" "tpl" {
      ~ id                      = "projects/prj-n-005-cloudops-618d/global/instanceTemplates/hpcsmall-login-default-20230203212654003700000002" -> (known after apply)
      ~ labels                  = { # forces replacement
          ~ "ghpc_blueprint"      = "hpc-cluster-small" -> "hpc-slurm"
          + "ghpc_module"         = "schedmd-slurm-gcp-v5-login"
            # (4 unchanged elements hidden)
        }
      ~ metadata_fingerprint    = "Ofivndf0_Sw=" -> (known after apply)
      ~ metadata_startup_script = <<-EOT # forces replacement
            #!/bin/bash
            # Copyright (C) SchedMD LLC.
            #
            # Licensed under the Apache License, Version 2.0 (the "License");
            # you may not use this file except in compliance with the License.
            # You may obtain a copy of the License at
            #
            #     http://www.apache.org/licenses/LICENSE-2.0
            #
            # Unless required by applicable law or agreed to in writing, software
            # distributed under the License is distributed on an "AS IS" BASIS,
            # WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
            # See the License for the specific language governing permissions and
            # limitations under the License.
            
            set -e
            
            SLURM_DIR=/slurm
            FLAGFILE=$SLURM_DIR/slurm_configured_do_not_remove
            SCRIPTS_DIR=$SLURM_DIR/scripts
            
            METADATA_SERVER="metadata.google.internal"
            URL="http://$METADATA_SERVER/computeMetadata/v1"
            HEADER="Metadata-Flavor:Google"
            CURL="curl -sS --fail --header $HEADER"
            
            function fetch_scripts {
            	# fetch project metadata
            	if ! CLUSTER=$($CURL $URL/instance/attributes/slurm_cluster_name); then
          - 		echo cluster name not found in instance metadata, quitting
          + 		echo "ERROR: cluster name not found in instance metadata. Quitting!"
            		return 1
            	fi
            	if ! META_DEVEL=$($CURL $URL/project/attributes/$CLUSTER-slurm-devel); then
          -         echo $CLUSTER-slurm-devel not found in project metadata, skipping script update
          + 		echo "WARNING: $CLUSTER-slurm-devel not found in project metadata, skipping script update"
            		return
            	fi
            	echo devel data found in project metadata, looking to update scripts
            	if STARTUP_SCRIPT=$(jq -re '."startup-script"' <<< "$META_DEVEL"); then
          - 		echo updating startup.sh from project metadata
          + 		echo "INFO: updating startup.sh from project metadata"
            		printf '%s' "$STARTUP_SCRIPT" > $STARTUP_SCRIPT_FILE
            	else
          - 		echo startup-script not found in project metadata, skipping update
          + 		echo "WARNING: startup-script not found in project metadata, skipping update"
            	fi
            	if SETUP_SCRIPT=$(jq -re '."setup-script"' <<< "$META_DEVEL"); then
          - 		echo updating setup.py from project metadata
          + 		echo "INFO: updating setup.py from project metadata"
            		printf '%s' "$SETUP_SCRIPT" > $SETUP_SCRIPT_FILE
            	else
          - 		echo setup-script not found in project metadata, skipping update
          + 		echo "WARNING: setup-script not found in project metadata, skipping update"
            	fi
            	if UTIL_SCRIPT=$(jq -re '."util-script"' <<< "$META_DEVEL"); then
          - 		echo updating util.py from project metadata
          + 		echo "INFO: updating util.py from project metadata"
            		printf '%s' "$UTIL_SCRIPT" > $UTIL_SCRIPT_FILE
            	else
          - 		echo util-script not found in project metadata, skipping update
          + 		echo "WARNING: util-script not found in project metadata, skipping update"
            	fi
            	if RESUME_SCRIPT=$(jq -re '."slurm-resume"' <<< "$META_DEVEL"); then
          - 		echo updating resume.py from project metadata
          + 		echo "INFO: updating resume.py from project metadata"
            		printf '%s' "$RESUME_SCRIPT" > $RESUME_SCRIPT_FILE
            	else
          - 		echo slurm-resume not found in project metadata, skipping update
          + 		echo "WARNING: slurm-resume not found in project metadata, skipping update"
            	fi
            	if SUSPEND_SCRIPT=$(jq -re '."slurm-suspend"' <<< "$META_DEVEL"); then
          - 		echo updating suspend.py from project metadata
          + 		echo "INFO: updating suspend.py from project metadata"
            		printf '%s' "$SUSPEND_SCRIPT" > $SUSPEND_SCRIPT_FILE
            	else
          - 		echo slurm-suspend not found in project metadata, skipping update
          + 		echo "WARNING: slurm-suspend not found in project metadata, skipping update"
            	fi
            	if SLURMSYNC_SCRIPT=$(jq -re '."slurmsync"' <<< "$META_DEVEL"); then
          - 		echo updating slurmsync.py from project metadata
          + 		echo "INFO: updating slurmsync.py from project metadata"
            		printf '%s' "$SLURMSYNC_SCRIPT" > $SLURMSYNC_SCRIPT_FILE
            	else
          - 		echo slurmsync not found in project metadata, skipping update
          + 		echo "WARNING: slurmsync not found in project metadata, skipping update"
            	fi
            	if SLURMEVENTD_SCRIPT=$(jq -re '."slurmeventd"' <<< "$META_DEVEL"); then
          - 		echo "updating slurmeventd.py from project metadata"
          + 		echo "INFO: updating slurmeventd.py from project metadata"
            		printf '%s' "$SLURMEVENTD_SCRIPT" > $SLURMEVENTD_SCRIPT_FILE
            	else
          - 		echo "slurmeventd not found in project metadata, skipping update"
          + 		echo "WARNING: slurmeventd not found in project metadata, skipping update"
            	fi
            }
            
            PING_METADATA="ping -q -w1 -c1 $METADATA_SERVER"
          - echo $PING_METADATA
          + echo "INFO: $PING_METADATA"
            for i in $(seq 10); do
                [ $i -gt 1 ] && sleep 5;
                $PING_METADATA > /dev/null && s=0 && break || s=$?;
          -     echo failed to contact metadata server, will retry
          +     echo "ERROR: Failed to contact metadata server, will retry"
            done
            if [ $s -ne 0 ]; then
          -     echo Unable to contact metadata server, aborting
          +     echo "ERROR: Unable to contact metadata server, aborting"
                wall -n '*** Slurm setup failed in the startup script! see `journalctl -u google-startup-scripts` ***'
                exit 1
            else
          -     echo Successfully contacted metadata server
          +     echo "INFO: Successfully contacted metadata server"
            fi
            
            GOOGLE_DNS=8.8.8.8
            PING_GOOGLE="ping -q -w1 -c1 $GOOGLE_DNS"
          - echo $PING_GOOGLE
          + echo "INFO: $PING_GOOGLE"
            for i in $(seq 5); do
                [ $i -gt 1 ] && sleep 2;
                $PING_GOOGLE > /dev/null && s=0 && break || s=$?;
          -     echo failed to ping Google DNS, will retry
          + 	echo "failed to ping Google DNS, will retry"
            done
            if [ $s -ne 0 ]; then
          -     echo No internet access detected
          +     echo "WARNING: No internet access detected"
            else
          -     echo Internet access detected
          +     echo "INFO: Internet access detected"
            fi
            
            mkdir -p $SCRIPTS_DIR
            
            STARTUP_SCRIPT_FILE=$SCRIPTS_DIR/startup.sh
            SETUP_SCRIPT_FILE=$SCRIPTS_DIR/setup.py
            UTIL_SCRIPT_FILE=$SCRIPTS_DIR/util.py
            RESUME_SCRIPT_FILE=$SCRIPTS_DIR/resume.py
            SUSPEND_SCRIPT_FILE=$SCRIPTS_DIR/suspend.py
            SLURMSYNC_SCRIPT_FILE=$SCRIPTS_DIR/slurmsync.py
            SLURMEVENTD_SCRIPT_FILE=$SCRIPTS_DIR/slurmeventd.py
            fetch_scripts
            
            if [ -f $FLAGFILE ]; then
          - 	echo "Slurm was previously configured, quitting"
          + 	echo "WARNING: Slurm was previously configured, quitting"
            	exit 0
            fi
            touch $FLAGFILE
            
          - echo "running python cluster setup script"
          + function fetch_feature {
          + 	if slurmd_feature="$($CURL $URL/instance/attributes/slurmd_feature)"; then
          + 		echo "$slurmd_feature"
          + 	else
          + 		echo ""
          + 	fi
          + }
          + SLURMD_FEATURE="$(fetch_feature)"
          + 
          + echo "INFO: Running python cluster setup script"
            chmod +x $SETUP_SCRIPT_FILE
            python3 $SCRIPTS_DIR/util.py
          - exec $SETUP_SCRIPT_FILE
          + if [[ -n "$SLURMD_FEATURE" ]]; then
          + 	echo "INFO: Running dynamic node setup."
          + 	exec $SETUP_SCRIPT_FILE --slurmd-feature="$SLURMD_FEATURE"
          + else
          + 	exec $SETUP_SCRIPT_FILE
          + fi
        EOT
      ~ name                    = "hpcsmall-login-default-20230203212654003700000002" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/prj-n-005-cloudops-618d/global/instanceTemplates/hpcsmall-login-default-20230203212654003700000002" -> (known after apply)
      ~ self_link_unique        = "https://www.googleapis.com/compute/v1/projects/prj-n-005-cloudops-618d/global/instanceTemplates/hpcsmall-login-default-20230203212654003700000002?uniqueId=8663258968345330382" -> (known after apply)
        tags                    = [
            "hpcsmall",
        ]
      + tags_fingerprint        = (known after apply)
        # (6 unchanged attributes hidden)
      ~ advanced_machine_features {
          - visible_core_count           = 0 -> null
            # (2 unchanged attributes hidden)
        }
      ~ disk {
          ~ device_name       = "persistent-disk-0" -> (known after apply)
          ~ interface         = "SCSI" -> (known after apply)
          ~ labels            = { # forces replacement
              ~ "ghpc_blueprint"      = "hpc-cluster-small" -> "hpc-slurm"
              + "ghpc_module"         = "schedmd-slurm-gcp-v5-login"
                # (4 unchanged elements hidden)
            }
          ~ mode              = "READ_WRITE" -> (known after apply)
          - resource_policies = [] -> null
          ~ source_image      = "projects/schedmd-slurm-public/global/images/family/schedmd-v5-slurm-22-05-4-hpc-centos-7" -> "projects/schedmd-slurm-public/global/images/family/slurm-gcp-5-7-hpc-centos-7" # forces replacement
            # (5 unchanged attributes hidden)
        }
      ~ network_interface {
          + ipv6_access_type   = (known after apply)
          ~ name               = "nic0" -> (known after apply)
          - queue_count        = 0 -> null
          + stack_type         = (known after apply)
          ~ subnetwork_project = "prj-n-shared-restricted-8521" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ scheduling {
          - min_node_cpus       = 0 -> null
          ~ provisioning_model  = "STANDARD" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }
  # module.compute_partition.module.slurm_partition.module.slurm_compute_template["ghpc"].module.instance_template.google_compute_instance_template.tpl must be replaced
+/- resource "google_compute_instance_template" "tpl" {
      ~ id                      = "projects/prj-n-005-cloudops-618d/global/instanceTemplates/hpcsmall-compute-compute-ghpc-20230203212654007000000003" -> (known after apply)
      ~ labels                  = { # forces replacement
          ~ "ghpc_blueprint"      = "hpc-cluster-small" -> "hpc-slurm"
          + "ghpc_module"         = "schedmd-slurm-gcp-v5-node-group"
            # (4 unchanged elements hidden)
        }
      ~ metadata_fingerprint    = "_9uI1_gj69g=" -> (known after apply)
      ~ metadata_startup_script = <<-EOT # forces replacement
            #!/bin/bash
            # Copyright (C) SchedMD LLC.
            #
            # Licensed under the Apache License, Version 2.0 (the "License");
            # you may not use this file except in compliance with the License.
            # You may obtain a copy of the License at
            #
            #     http://www.apache.org/licenses/LICENSE-2.0
            #
            # Unless required by applicable law or agreed to in writing, software
            # distributed under the License is distributed on an "AS IS" BASIS,
            # WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
            # See the License for the specific language governing permissions and
            # limitations under the License.
            
            set -e
            
            SLURM_DIR=/slurm
            FLAGFILE=$SLURM_DIR/slurm_configured_do_not_remove
            SCRIPTS_DIR=$SLURM_DIR/scripts
            
            METADATA_SERVER="metadata.google.internal"
            URL="http://$METADATA_SERVER/computeMetadata/v1"
            HEADER="Metadata-Flavor:Google"
            CURL="curl -sS --fail --header $HEADER"
            
            function fetch_scripts {
            	# fetch project metadata
            	if ! CLUSTER=$($CURL $URL/instance/attributes/slurm_cluster_name); then
          - 		echo cluster name not found in instance metadata, quitting
          + 		echo "ERROR: cluster name not found in instance metadata. Quitting!"
            		return 1
            	fi
            	if ! META_DEVEL=$($CURL $URL/project/attributes/$CLUSTER-slurm-devel); then
          -         echo $CLUSTER-slurm-devel not found in project metadata, skipping script update
          + 		echo "WARNING: $CLUSTER-slurm-devel not found in project metadata, skipping script update"
            		return
            	fi
            	echo devel data found in project metadata, looking to update scripts
            	if STARTUP_SCRIPT=$(jq -re '."startup-script"' <<< "$META_DEVEL"); then
          - 		echo updating startup.sh from project metadata
          + 		echo "INFO: updating startup.sh from project metadata"
            		printf '%s' "$STARTUP_SCRIPT" > $STARTUP_SCRIPT_FILE
            	else
          - 		echo startup-script not found in project metadata, skipping update
          + 		echo "WARNING: startup-script not found in project metadata, skipping update"
            	fi
            	if SETUP_SCRIPT=$(jq -re '."setup-script"' <<< "$META_DEVEL"); then
          - 		echo updating setup.py from project metadata
          + 		echo "INFO: updating setup.py from project metadata"
            		printf '%s' "$SETUP_SCRIPT" > $SETUP_SCRIPT_FILE
            	else
          - 		echo setup-script not found in project metadata, skipping update
          + 		echo "WARNING: setup-script not found in project metadata, skipping update"
            	fi
            	if UTIL_SCRIPT=$(jq -re '."util-script"' <<< "$META_DEVEL"); then
          - 		echo updating util.py from project metadata
          + 		echo "INFO: updating util.py from project metadata"
            		printf '%s' "$UTIL_SCRIPT" > $UTIL_SCRIPT_FILE
            	else
          - 		echo util-script not found in project metadata, skipping update
          + 		echo "WARNING: util-script not found in project metadata, skipping update"
            	fi
            	if RESUME_SCRIPT=$(jq -re '."slurm-resume"' <<< "$META_DEVEL"); then
          - 		echo updating resume.py from project metadata
          + 		echo "INFO: updating resume.py from project metadata"
            		printf '%s' "$RESUME_SCRIPT" > $RESUME_SCRIPT_FILE
            	else
          - 		echo slurm-resume not found in project metadata, skipping update
          + 		echo "WARNING: slurm-resume not found in project metadata, skipping update"
            	fi
            	if SUSPEND_SCRIPT=$(jq -re '."slurm-suspend"' <<< "$META_DEVEL"); then
          - 		echo updating suspend.py from project metadata
          + 		echo "INFO: updating suspend.py from project metadata"
            		printf '%s' "$SUSPEND_SCRIPT" > $SUSPEND_SCRIPT_FILE
            	else
          - 		echo slurm-suspend not found in project metadata, skipping update
          + 		echo "WARNING: slurm-suspend not found in project metadata, skipping update"
            	fi
            	if SLURMSYNC_SCRIPT=$(jq -re '."slurmsync"' <<< "$META_DEVEL"); then
          - 		echo updating slurmsync.py from project metadata
          + 		echo "INFO: updating slurmsync.py from project metadata"
            		printf '%s' "$SLURMSYNC_SCRIPT" > $SLURMSYNC_SCRIPT_FILE
            	else
          - 		echo slurmsync not found in project metadata, skipping update
          + 		echo "WARNING: slurmsync not found in project metadata, skipping update"
            	fi
            	if SLURMEVENTD_SCRIPT=$(jq -re '."slurmeventd"' <<< "$META_DEVEL"); then
          - 		echo "updating slurmeventd.py from project metadata"
          + 		echo "INFO: updating slurmeventd.py from project metadata"
            		printf '%s' "$SLURMEVENTD_SCRIPT" > $SLURMEVENTD_SCRIPT_FILE
            	else
          - 		echo "slurmeventd not found in project metadata, skipping update"
          + 		echo "WARNING: slurmeventd not found in project metadata, skipping update"
            	fi
            }
            
            PING_METADATA="ping -q -w1 -c1 $METADATA_SERVER"
          - echo $PING_METADATA
          + echo "INFO: $PING_METADATA"
            for i in $(seq 10); do
                [ $i -gt 1 ] && sleep 5;
                $PING_METADATA > /dev/null && s=0 && break || s=$?;
          -     echo failed to contact metadata server, will retry
          +     echo "ERROR: Failed to contact metadata server, will retry"
            done
            if [ $s -ne 0 ]; then
          -     echo Unable to contact metadata server, aborting
          +     echo "ERROR: Unable to contact metadata server, aborting"
                wall -n '*** Slurm setup failed in the startup script! see `journalctl -u google-startup-scripts` ***'
                exit 1
            else
          -     echo Successfully contacted metadata server
          +     echo "INFO: Successfully contacted metadata server"
            fi
            
            GOOGLE_DNS=8.8.8.8
            PING_GOOGLE="ping -q -w1 -c1 $GOOGLE_DNS"
          - echo $PING_GOOGLE
          + echo "INFO: $PING_GOOGLE"
            for i in $(seq 5); do
                [ $i -gt 1 ] && sleep 2;
                $PING_GOOGLE > /dev/null && s=0 && break || s=$?;
          -     echo failed to ping Google DNS, will retry
          + 	echo "failed to ping Google DNS, will retry"
            done
            if [ $s -ne 0 ]; then
          -     echo No internet access detected
          +     echo "WARNING: No internet access detected"
            else
          -     echo Internet access detected
          +     echo "INFO: Internet access detected"
            fi
            
            mkdir -p $SCRIPTS_DIR
            
            STARTUP_SCRIPT_FILE=$SCRIPTS_DIR/startup.sh
            SETUP_SCRIPT_FILE=$SCRIPTS_DIR/setup.py
            UTIL_SCRIPT_FILE=$SCRIPTS_DIR/util.py
            RESUME_SCRIPT_FILE=$SCRIPTS_DIR/resume.py
            SUSPEND_SCRIPT_FILE=$SCRIPTS_DIR/suspend.py
            SLURMSYNC_SCRIPT_FILE=$SCRIPTS_DIR/slurmsync.py
            SLURMEVENTD_SCRIPT_FILE=$SCRIPTS_DIR/slurmeventd.py
            fetch_scripts
            
            if [ -f $FLAGFILE ]; then
          - 	echo "Slurm was previously configured, quitting"
          + 	echo "WARNING: Slurm was previously configured, quitting"
            	exit 0
            fi
            touch $FLAGFILE
            
          - echo "running python cluster setup script"
          + function fetch_feature {
          + 	if slurmd_feature="$($CURL $URL/instance/attributes/slurmd_feature)"; then
          + 		echo "$slurmd_feature"
          + 	else
          + 		echo ""
          + 	fi
          + }
          + SLURMD_FEATURE="$(fetch_feature)"
          + 
          + echo "INFO: Running python cluster setup script"
            chmod +x $SETUP_SCRIPT_FILE
            python3 $SCRIPTS_DIR/util.py
          - exec $SETUP_SCRIPT_FILE
          + if [[ -n "$SLURMD_FEATURE" ]]; then
          + 	echo "INFO: Running dynamic node setup."
          + 	exec $SETUP_SCRIPT_FILE --slurmd-feature="$SLURMD_FEATURE"
          + else
          + 	exec $SETUP_SCRIPT_FILE
          + fi
        EOT
      ~ name                    = "hpcsmall-compute-compute-ghpc-20230203212654007000000003" -> (known after apply)
      ~ region                  = "northamerica-northeast1" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/prj-n-005-cloudops-618d/global/instanceTemplates/hpcsmall-compute-compute-ghpc-20230203212654007000000003" -> (known after apply)
      ~ self_link_unique        = "https://www.googleapis.com/compute/v1/projects/prj-n-005-cloudops-618d/global/instanceTemplates/hpcsmall-compute-compute-ghpc-20230203212654007000000003?uniqueId=8929794030165869263" -> (known after apply)
        tags                    = [
            "hpcsmall",
        ]
      + tags_fingerprint        = (known after apply)
        # (5 unchanged attributes hidden)
      ~ advanced_machine_features {
          - visible_core_count           = 0 -> null
            # (2 unchanged attributes hidden)
        }
      ~ disk {
          ~ device_name       = "persistent-disk-0" -> (known after apply)
          ~ interface         = "SCSI" -> (known after apply)
          ~ labels            = { # forces replacement
              ~ "ghpc_blueprint"      = "hpc-cluster-small" -> "hpc-slurm"
              + "ghpc_module"         = "schedmd-slurm-gcp-v5-node-group"
                # (4 unchanged elements hidden)
            }
          ~ mode              = "READ_WRITE" -> (known after apply)
          - resource_policies = [] -> null
          ~ source_image      = "projects/schedmd-slurm-public/global/images/family/schedmd-v5-slurm-22-05-4-hpc-centos-7" -> "projects/schedmd-slurm-public/global/images/family/slurm-gcp-5-7-hpc-centos-7" # forces replacement
            # (5 unchanged attributes hidden)
        }
      ~ network_interface {
          + ipv6_access_type   = (known after apply)
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/prj-n-shared-restricted-8521/global/networks/vpc-n-shared-restricted" -> (known after apply)
          - queue_count        = 0 -> null
          + stack_type         = (known after apply)
          ~ subnetwork_project = "prj-n-shared-restricted-8521" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
      ~ scheduling {
          - min_node_cpus       = 0 -> null
          ~ provisioning_model  = "STANDARD" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }
  # module.debug_partition.module.slurm_partition.module.slurm_compute_template["ghpc"].module.instance_template.google_compute_instance_template.tpl must be replaced
+/- resource "google_compute_instance_template" "tpl" {
      ~ id                      = "projects/prj-n-005-cloudops-618d/global/instanceTemplates/hpcsmall-compute-debug-ghpc-20230203212654016100000004" -> (known after apply)
      ~ labels                  = { # forces replacement
          ~ "ghpc_blueprint"      = "hpc-cluster-small" -> "hpc-slurm"
          + "ghpc_module"         = "schedmd-slurm-gcp-v5-node-group"
            # (4 unchanged elements hidden)
        }
      ~ metadata_fingerprint    = "_9uI1_gj69g=" -> (known after apply)
      ~ metadata_startup_script = <<-EOT # forces replacement
            #!/bin/bash
            # Copyright (C) SchedMD LLC.
            #
            # Licensed under the Apache License, Version 2.0 (the "License");
            # you may not use this file except in compliance with the License.
            # You may obtain a copy of the License at
            #
            #     http://www.apache.org/licenses/LICENSE-2.0
            #
            # Unless required by applicable law or agreed to in writing, software
            # distributed under the License is distributed on an "AS IS" BASIS,
            # WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
            # See the License for the specific language governing permissions and
            # limitations under the License.
            
            set -e
            
            SLURM_DIR=/slurm
            FLAGFILE=$SLURM_DIR/slurm_configured_do_not_remove
            SCRIPTS_DIR=$SLURM_DIR/scripts
            
            METADATA_SERVER="metadata.google.internal"
            URL="http://$METADATA_SERVER/computeMetadata/v1"
            HEADER="Metadata-Flavor:Google"
            CURL="curl -sS --fail --header $HEADER"
            
            function fetch_scripts {
            	# fetch project metadata
            	if ! CLUSTER=$($CURL $URL/instance/attributes/slurm_cluster_name); then
          - 		echo cluster name not found in instance metadata, quitting
          + 		echo "ERROR: cluster name not found in instance metadata. Quitting!"
            		return 1
            	fi
            	if ! META_DEVEL=$($CURL $URL/project/attributes/$CLUSTER-slurm-devel); then
          -         echo $CLUSTER-slurm-devel not found in project metadata, skipping script update
          + 		echo "WARNING: $CLUSTER-slurm-devel not found in project metadata, skipping script update"
            		return
            	fi
            	echo devel data found in project metadata, looking to update scripts
            	if STARTUP_SCRIPT=$(jq -re '."startup-script"' <<< "$META_DEVEL"); then
          - 		echo updating startup.sh from project metadata
          + 		echo "INFO: updating startup.sh from project metadata"
            		printf '%s' "$STARTUP_SCRIPT" > $STARTUP_SCRIPT_FILE
            	else
          - 		echo startup-script not found in project metadata, skipping update
          + 		echo "WARNING: startup-script not found in project metadata, skipping update"
            	fi
            	if SETUP_SCRIPT=$(jq -re '."setup-script"' <<< "$META_DEVEL"); then
          - 		echo updating setup.py from project metadata
          + 		echo "INFO: updating setup.py from project metadata"
            		printf '%s' "$SETUP_SCRIPT" > $SETUP_SCRIPT_FILE
            	else
          - 		echo setup-script not found in project metadata, skipping update
          + 		echo "WARNING: setup-script not found in project metadata, skipping update"
            	fi
            	if UTIL_SCRIPT=$(jq -re '."util-script"' <<< "$META_DEVEL"); then
          - 		echo updating util.py from project metadata
          + 		echo "INFO: updating util.py from project metadata"
            		printf '%s' "$UTIL_SCRIPT" > $UTIL_SCRIPT_FILE
            	else
          - 		echo util-script not found in project metadata, skipping update
          + 		echo "WARNING: util-script not found in project metadata, skipping update"
            	fi
            	if RESUME_SCRIPT=$(jq -re '."slurm-resume"' <<< "$META_DEVEL"); then
          - 		echo updating resume.py from project metadata
          + 		echo "INFO: updating resume.py from project metadata"
            		printf '%s' "$RESUME_SCRIPT" > $RESUME_SCRIPT_FILE
            	else
          - 		echo slurm-resume not found in project metadata, skipping update
          + 		echo "WARNING: slurm-resume not found in project metadata, skipping update"
            	fi
            	if SUSPEND_SCRIPT=$(jq -re '."slurm-suspend"' <<< "$META_DEVEL"); then
          - 		echo updating suspend.py from project metadata
          + 		echo "INFO: updating suspend.py from project metadata"
            		printf '%s' "$SUSPEND_SCRIPT" > $SUSPEND_SCRIPT_FILE
            	else
          - 		echo slurm-suspend not found in project metadata, skipping update
          + 		echo "WARNING: slurm-suspend not found in project metadata, skipping update"
            	fi
            	if SLURMSYNC_SCRIPT=$(jq -re '."slurmsync"' <<< "$META_DEVEL"); then
          - 		echo updating slurmsync.py from project metadata
          + 		echo "INFO: updating slurmsync.py from project metadata"
            		printf '%s' "$SLURMSYNC_SCRIPT" > $SLURMSYNC_SCRIPT_FILE
            	else
          - 		echo slurmsync not found in project metadata, skipping update
          + 		echo "WARNING: slurmsync not found in project metadata, skipping update"
            	fi
            	if SLURMEVENTD_SCRIPT=$(jq -re '."slurmeventd"' <<< "$META_DEVEL"); then
          - 		echo "updating slurmeventd.py from project metadata"
          + 		echo "INFO: updating slurmeventd.py from project metadata"
            		printf '%s' "$SLURMEVENTD_SCRIPT" > $SLURMEVENTD_SCRIPT_FILE
            	else
          - 		echo "slurmeventd not found in project metadata, skipping update"
          + 		echo "WARNING: slurmeventd not found in project metadata, skipping update"
            	fi
            }
            
            PING_METADATA="ping -q -w1 -c1 $METADATA_SERVER"
          - echo $PING_METADATA
          + echo "INFO: $PING_METADATA"
            for i in $(seq 10); do
                [ $i -gt 1 ] && sleep 5;
                $PING_METADATA > /dev/null && s=0 && break || s=$?;
          -     echo failed to contact metadata server, will retry
          +     echo "ERROR: Failed to contact metadata server, will retry"
            done
            if [ $s -ne 0 ]; then
          -     echo Unable to contact metadata server, aborting
          +     echo "ERROR: Unable to contact metadata server, aborting"
                wall -n '*** Slurm setup failed in the startup script! see `journalctl -u google-startup-scripts` ***'
                exit 1
            else
          -     echo Successfully contacted metadata server
          +     echo "INFO: Successfully contacted metadata server"
            fi
            
            GOOGLE_DNS=8.8.8.8
            PING_GOOGLE="ping -q -w1 -c1 $GOOGLE_DNS"
          - echo $PING_GOOGLE
          + echo "INFO: $PING_GOOGLE"
            for i in $(seq 5); do
                [ $i -gt 1 ] && sleep 2;
                $PING_GOOGLE > /dev/null && s=0 && break || s=$?;
          -     echo failed to ping Google DNS, will retry
          + 	echo "failed to ping Google DNS, will retry"
            done
            if [ $s -ne 0 ]; then
          -     echo No internet access detected
          +     echo "WARNING: No internet access detected"
            else
          -     echo Internet access detected
          +     echo "INFO: Internet access detected"
            fi
            
            mkdir -p $SCRIPTS_DIR
            
            STARTUP_SCRIPT_FILE=$SCRIPTS_DIR/startup.sh
            SETUP_SCRIPT_FILE=$SCRIPTS_DIR/setup.py
            UTIL_SCRIPT_FILE=$SCRIPTS_DIR/util.py
            RESUME_SCRIPT_FILE=$SCRIPTS_DIR/resume.py
            SUSPEND_SCRIPT_FILE=$SCRIPTS_DIR/suspend.py
            SLURMSYNC_SCRIPT_FILE=$SCRIPTS_DIR/slurmsync.py
            SLURMEVENTD_SCRIPT_FILE=$SCRIPTS_DIR/slurmeventd.py
            fetch_scripts
            
            if [ -f $FLAGFILE ]; then
          - 	echo "Slurm was previously configured, quitting"
          + 	echo "WARNING: Slurm was previously configured, quitting"
            	exit 0
            fi
            touch $FLAGFILE
            
          - echo "running python cluster setup script"
          + function fetch_feature {
          + 	if slurmd_feature="$($CURL $URL/instance/attributes/slurmd_feature)"; then
          + 		echo "$slurmd_feature"
          + 	else
          + 		echo ""
          + 	fi
          + }
          + SLURMD_FEATURE="$(fetch_feature)"
          + 
          + echo "INFO: Running python cluster setup script"
            chmod +x $SETUP_SCRIPT_FILE
            python3 $SCRIPTS_DIR/util.py
          - exec $SETUP_SCRIPT_FILE
          + if [[ -n "$SLURMD_FEATURE" ]]; then
          + 	echo "INFO: Running dynamic node setup."
          + 	exec $SETUP_SCRIPT_FILE --slurmd-feature="$SLURMD_FEATURE"
          + else
          + 	exec $SETUP_SCRIPT_FILE
          + fi
        EOT
      ~ name                    = "hpcsmall-compute-debug-ghpc-20230203212654016100000004" -> (known after apply)
      ~ region                  = "northamerica-northeast1" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/prj-n-005-cloudops-618d/global/instanceTemplates/hpcsmall-compute-debug-ghpc-20230203212654016100000004" -> (known after apply)
      ~ self_link_unique        = "https://www.googleapis.com/compute/v1/projects/prj-n-005-cloudops-618d/global/instanceTemplates/hpcsmall-compute-debug-ghpc-20230203212654016100000004?uniqueId=293862189556613873" -> (known after apply)
        tags                    = [
            "hpcsmall",
        ]
      + tags_fingerprint        = (known after apply)
        # (5 unchanged attributes hidden)
      ~ advanced_machine_features {
          - visible_core_count           = 0 -> null
            # (2 unchanged attributes hidden)
        }
      ~ disk {
          ~ device_name       = "persistent-disk-0" -> (known after apply)
          ~ interface         = "SCSI" -> (known after apply)
          ~ labels            = { # forces replacement
              ~ "ghpc_blueprint"      = "hpc-cluster-small" -> "hpc-slurm"
              + "ghpc_module"         = "schedmd-slurm-gcp-v5-node-group"
                # (4 unchanged elements hidden)
            }
          ~ mode              = "READ_WRITE" -> (known after apply)
          - resource_policies = [] -> null
          ~ source_image      = "projects/schedmd-slurm-public/global/images/family/schedmd-v5-slurm-22-05-4-hpc-centos-7" -> "projects/schedmd-slurm-public/global/images/family/slurm-gcp-5-7-hpc-centos-7" # forces replacement
            # (5 unchanged attributes hidden)
        }
      ~ network_interface {
          + ipv6_access_type   = (known after apply)
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/prj-n-shared-restricted-8521/global/networks/vpc-n-shared-restricted" -> (known after apply)
          - queue_count        = 0 -> null
          + stack_type         = (known after apply)
          ~ subnetwork_project = "prj-n-shared-restricted-8521" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
      ~ scheduling {
          - min_node_cpus       = 0 -> null
          ~ provisioning_model  = "STANDARD" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }
Plan: 13 to add, 3 to change, 6 to destroy.